<?php

$h1 = 'Информация обо мне';
$title = 'Главная страница - страница обо мне';
$year = '2018';

?>

<!DOCTYPE html>
<html lang="en">

<head>
    <title><?=$title?></title>
    <meta charset="UTF-8">
</head>

<body>
<h1><?=$h1?></h1>
Краткая биография
Родился в 1986 году в городе Курск. Закончил в 2014 году "Индустриальный институт". На данный момент работаю программистом линии поверхностного монтажа в частной компании.
<br><br>
<b>Просто пример жирного текста</b>
<br><br>
<?=$year?>
</body>

</html>